# Pandas
- Solve short hands-on challenges to perfect your data manipulation skills.
- https://www.kaggle.com/learn/pandas

## 5.- Exercise: Data Types and Missing Values
- Deal with the most common progress-blocking problems

In [27]:
import numpy as np
import pandas as pd

print('np.__version__:', np.__version__)
print('pd.__version__:', pd.__version__)

#pd.set_option('display.max_rows', 5)

np.__version__: 1.23.5
pd.__version__: 1.5.3

In [28]:
reviews = pd.read_csv('Red.csv')
reviews.head(2)

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year
0,Pomerol 2011,France,Pomerol,Château La Providence,4.2,100,95.0,2011
1,Lirac 2017,France,Lirac,Château Mont-Redon,4.3,100,15.5,2017

In [29]:
## Add a twitter_region column !
reviews['twitter_region'] = '@' +  reviews.Region
reviews.head(2)

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
0,Pomerol 2011,France,Pomerol,Château La Providence,4.2,100,95.0,2011,@Pomerol
1,Lirac 2017,France,Lirac,Château Mont-Redon,4.3,100,15.5,2017,@Lirac

In [30]:
reviews.info()
# 8666 non-null every col -> idem RangeIndex

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8666 entries, 0 to 8665
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             8666 non-null   object
 1   Country          8666 non-null   object
 2   Region           8666 non-null   object
 3   Winery           8666 non-null   object
 4   Rating           8666 non-null   float64
 5   NumberOfRatings  8666 non-null   int64
 6   Price            8666 non-null   float64
 7   Year             8666 non-null   object
 8   twitter_region   8666 non-null   object
dtypes: float64(2), int64(1), object(6)
memory usage: 609.5+ KB

In [31]:
## Adding rows with NaN Values - new 'revs' df to work on...

# add a row at the end
ndf_row1 = pd.DataFrame({'Name': 'Name1', 'Country': np.nan, 'Region': 'Reg1',
                         'Winery': 'Win1', 'Rating': 1, 'NumberOfRatings': 101,
                         'Price': 10.1, 'Year': 2021, 'twitter_region': '@Reg1'}, index=[0])

revs = pd.concat([reviews, ndf_row1]).reset_index(drop=True)    # concat at the end

# add a row at the beginning
ndf_row2 = pd.DataFrame({'Name': 'Name2', 'Country': np.nan, 'Region': 'Reg2',
                         'Winery': 'Win2', 'Rating': 2, 'NumberOfRatings': 202,
                         'Price': 20., 'Year': 2022, 'twitter_region': '@Reg2'}, index=[0])

revs = pd.concat([ndf_row2, revs]).reset_index(drop=True)    # concat at the beginning and in the same df

# Insert a row somewhere in the middle
lst_row3 = ['Name3', np.nan, 'Reg3', 'Win3', np.nan, 303, np.nan,2023, '@Reg3']
revs.loc[3423.5] = lst_row3                         # make index float and insert in .5
revs = revs.sort_index().reset_index(drop=True)     # mak index int again and interpolate values

display(revs.tail(2))
display(revs.head(2))
display(revs.loc[3422:3426])
print(revs.info())              # some cols non-null < 8669
revs.index, revs.index.dtype

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
8667,Portillo Cabernet Sauvignon 2016,Argentina,Tunuyán,Salentein,3.4,999,7.88,2016,@Tunuyán
8668,Name1,NaN,Reg1,Win1,1.0,101,10.10,2021,@Reg1

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
0,Name2,NaN,Reg2,Win2,2.0,202,20.0,2022,@Reg2
1,Pomerol 2011,France,Pomerol,Château La Providence,4.2,100,95.0,2011,@Pomerol

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
3422,Les Saint-Georges Nuits-Saint-Georges 1er Cru ...,France,Nuits-Saint-Georges Premier Cru,Domaine Robert Chevillon,4.1,28,113.39,2015,@Nuits-Saint-Georges Premier Cru
3423,Castel Firmian Riserva Teroldego Rotaliano 2015,Italy,Teroldego Rotaliano,Mezzacorona,3.7,28,9.37,2015,@Teroldego Rotaliano
3424,Name3,NaN,Reg3,Win3,NaN,303,NaN,2023,@Reg3
3425,Barolo 2016,Italy,Barolo,Mauro Molino,3.8,28,36.50,2016,@Barolo
3426,Primitivo (Since 1913) 2017,Italy,Primitivo di Manduria,Torrevento,3.9,28,14.35,2017,@Primitivo di Manduria

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8669 entries, 0 to 8668
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             8669 non-null   object
 1   Country          8666 non-null   object
 2   Region           8669 non-null   object
 3   Winery           8669 non-null   object
 4   Rating           8668 non-null   float64
 5   NumberOfRatings  8669 non-null   int64
 6   Price            8668 non-null   float64
 7   Year             8669 non-null   object
 8   twitter_region   8669 non-null   object
dtypes: float64(2), int64(1), object(6)
memory usage: 609.7+ KB
None

(RangeIndex(start=0, stop=8669, step=1), dtype('int64'))

### 1.- What is the data type of the points column in the dataset?

In [32]:
# for Rating col > a Value
Rating_dtype = revs.Rating.dtype
print(Rating_dtype, ' - ', type(Rating_dtype))

float64  -  <class 'numpy.dtype[float64]'>

In [33]:
# alt  -- all cols > a Series
revs.dtypes, type(revs.dtypes)

(Name                object
 Country             object
 Region              object
 Winery              object
 Rating             float64
 NumberOfRatings      int64
 Price              float64
 Year                object
 twitter_region      object
 dtype: object,
 pandas.core.series.Series)

In [34]:
# alt  -- more info > a df?
revs_info = revs.info()
print(revs_info, '  --  ', type(revs_info))
type(revs_info)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8669 entries, 0 to 8668
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             8669 non-null   object
 1   Country          8666 non-null   object
 2   Region           8669 non-null   object
 3   Winery           8669 non-null   object
 4   Rating           8668 non-null   float64
 5   NumberOfRatings  8669 non-null   int64
 6   Price            8668 non-null   float64
 7   Year             8669 non-null   object
 8   twitter_region   8669 non-null   object
dtypes: float64(2), int64(1), object(6)
memory usage: 609.7+ KB
None   --   <class 'NoneType'>

NoneType

### 2.- Create a Series from entries in the points column, but convert the entries to strings. Hint: strings are str in native Python.

In [35]:
# use Rating col  - change type: astype
rating_str = revs.Rating.astype('str')
rating_str, type(rating_str), rating_str.dtype

(0       2.0
 1       4.2
 2       4.3
 3       3.9
 4       3.5
        ...
 8664    4.0
 8665    3.7
 8666    3.5
 8667    3.4
 8668    1.0
 Name: Rating, Length: 8669, dtype: object,
 pandas.core.series.Series,
 dtype('O'))

### 3.- Sometimes the price column is null. How many reviews in the dataset are missing a price?

In [38]:
# Price
display(revs[pd.isnull(revs.Price)])
len(revs[pd.isnull(revs.Price)])

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
3424,Name3,NaN,Reg3,Win3,NaN,303,NaN,2023,@Reg3

1

### 4.- What are the most common wine-producing regions? Create a Series counting the number of times each value occurs in the region_1 field. This field is often missing data, so replace missing values with Unknown. Sort in descending order. Your output should look something like this:

In [39]:
# Use Country col - Now see no NaN col
revs.Name.value_counts()

Cabernet Sauvignon 2017          43
Cabernet Sauvignon 2016          41
Cabernet Sauvignon 2015          35
Crianza 2016                     27
Pinot Noir 2017                  25
                                 ..
Crianza Ribera del Duero 2014     1
La Mancha Reserva 2005            1
Pura Fe Carmenère 2016            1
Kékfrankos Balf 2017              1
Name1                             1
Name: Name, Length: 6724, dtype: int64

In [42]:
# Country has NaN values
display(revs[pd.isnull(revs.Country)])
revs.Country.value_counts().sort_values(ascending=True)

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
0,Name2,NaN,Reg2,Win2,2.0,202,20.0,2022,@Reg2
3424,Name3,NaN,Reg3,Win3,NaN,303,NaN,2023,@Reg3
8668,Name1,NaN,Reg1,Win1,1.0,101,10.1,2021,@Reg1

Slovakia            1
Mexico              1
China               1
Canada              2
Bulgaria            2
Croatia             2
Uruguay             4
Georgia             5
Turkey              6
Slovenia            8
Moldova             8
Hungary             9
Switzerland        12
Greece             13
Israel             13
Lebanon            15
Romania            23
Brazil             40
New Zealand        63
Austria           220
Portugal          230
Argentina         246
Australia         246
Germany           248
Chile             326
United States     374
South Africa      500
Spain            1142
France           2256
Italy            2650
Name: Country, dtype: int64

In [45]:
revs['Country'] = revs.Country.replace(np.nan, 'Unknown')
revs.loc[revs.Country == 'Unknown']

,Name,Country,Region,Winery,Rating,NumberOfRatings,Price,Year,twitter_region
0,Name2,Unknown,Reg2,Win2,2.0,202,20.0,2022,@Reg2
3424,Name3,Unknown,Reg3,Win3,NaN,303,NaN,2023,@Reg3
8668,Name1,Unknown,Reg1,Win1,1.0,101,10.1,2021,@Reg1

In [47]:
revs.Country.value_counts(ascending=True)

Slovakia            1
China               1
Mexico              1
Canada              2
Croatia             2
Bulgaria            2
Unknown             3
Uruguay             4
Georgia             5
Turkey              6
Slovenia            8
Moldova             8
Hungary             9
Switzerland        12
Greece             13
Israel             13
Lebanon            15
Romania            23
Brazil             40
New Zealand        63
Austria           220
Portugal          230
Argentina         246
Australia         246
Germany           248
Chile             326
United States     374
South Africa      500
Spain            1142
France           2256
Italy            2650
Name: Country, dtype: int64

In [46]:
revs.loc[revs.Region == 'Tunuyán'].Country.value_counts()

Argentina    7
Name: Country, dtype: int64

In [ ]:
## 4 OK
#import numpy as np
#reviews.region_1.replace(np.nan, 'Unknown')
reviews.region_1 = reviews.region_1.fillna('Unknown')
reviews_per_region = reviews.region_1.value_counts()